import 'package:ndfl/model/filter.dart';

class Filters {

  List<Filter> list() {
    return <Filter> [
      Filter('无滤镜', [
        1,   0,   0, 0, 0,
        0,   1,   0, 0, 0,
        0,   0,   1, 0, 0,
        0,   0,   0, 1, 0,
      ]),
      Filter('黑白', [
      0.2126,
      0.7152,
      0.0722,
      0,
      0,
      0.2126,
      0.7152,
      0.0722,
      0,
      0,
      0.2126,
      0.7152,
      0.0722,
      0,
      0,
      0,
      0,
      0,
      1,
      0,
      ]),
      Filter('复古', [
        1,   0,   0, 0, 0,
        0, 0.8,   0, 0, 0,
        0,   0, 0.6, 0, 0,
        0,   0,   0, 1, 0,
      ]),
      Filter('冷色', [
        1, 0, 0, 0, 0,
        0, 1, 0.2, 0, 0,
        0, 0, 1, 0, 0,
        0, 0, 0, 1, 0,
      ]),
      Filter('胶片', [
        1.3,  0.1,  0.0, 0, 0,   // 增强红色通道
        0.0,  1.1,  0.0, 0, 0,   // 轻微增强绿色
        -0.1, 0.0,  0.9, 0, 0,   // 降低蓝色通道
        0,     0,    0,   1, 0,   // 保持Alpha不变
      ]),
      Filter('日系', [
        1.05, 0.05, 0.0, 0, 20,  // 提高亮度并偏青
        0.0,  1.05, 0.0, 0, 20,  // 轻微过曝效果
        0.0,  0.05, 1.0, 0, 20,  // 冷色调处理
        0,     0,    0,   1, 0,
      ]),
      Filter('负片', [
        -1.0, 0.0,  0.0, 0, 255, // 反转红色通道
        0.0, -1.0,  0.0, 0, 255, // 反转绿色通道
        0.0, 0.0,  -1.0, 0, 255, // 反转蓝色通道
        0.0, 0.0,  0.0, 1.0, 0,  // 保持Alpha不变
      ]),
      Filter('怀旧', [
        0.8, 0.3, 0.1, 0, 50,   // 增强红色和黄色
        0.1, 0.7, 0.2, 0, 30,   // 降低绿色通道
        0.1, 0.2, 0.5, 0, 20,   // 大幅降低蓝色
        0,    0,   0,   1, 0,
      ]),
      Filter('赛博', [
        1.5, 0.0, 0.0, 0, -50,  // 增强红色
        0.0, 1.2, 0.0, 0, -30,  // 增强绿色
        0.0, 0.0, 1.5, 0, -50,  // 增强蓝色
        0,    0,   0,   1, 0,
      ]),
      Filter('牛奶', [
        0, 1.0, 0,   0, 0, 
        0, 1.0, 0,   0, 0,
        0, 0.6, 1.0, 0, 0, 
        0, 0,   0,   1, 0,
      ]),

    ];
  }
}

  // final List<ColorFilter> _standardFilters = [
  //   // 黑白滤镜
  //   const ColorFilter.matrix(_filterMatrixs[0]),
  //   // 复古滤镜
  //   const ColorFilter.matrix([
  //     1,   0,   0, 0, 0,
  //     0, 0.8,   0, 0, 0,
  //     0,   0, 0.6, 0, 0,
  //     0,   0,   0, 1, 0,
  //   ]),
  //   // 冷色调
  //   const ColorFilter.matrix([
  //     1, 0, 0, 0, 0,
  //     0, 1, 0.2, 0, 0,
  //     0, 0, 1, 0, 0,
  //     0, 0, 0, 1, 0,
  //   ]),
  //   // 胶片:柯达胶片暖色调,增强对比度
  //   const ColorFilter.matrix([
  //     1.3,  0.1,  0.0, 0, 0,   // 增强红色通道
  //     0.0,  1.1,  0.0, 0, 0,   // 轻微增强绿色
  //     -0.1, 0.0,  0.9, 0, 0,   // 降低蓝色通道
  //     0,     0,    0,   1, 0,   // 保持Alpha不变
  //   ]),
  //   // 日系:高亮度低对比,冷色偏青,富士
  //   const ColorFilter.matrix([
  //     1.05, 0.05, 0.0, 0, 20,  // 提高亮度并偏青
  //     0.0,  1.05, 0.0, 0, 20,  // 轻微过曝效果
  //     0.0,  0.05, 1.0, 0, 20,  // 冷色调处理
  //     0,     0,    0,   1, 0,
  //   ]),
  //   // 负片
  //   const ColorFilter.matrix([
  //     -1.0, 0.0,  0.0, 0, 255, // 反转红色通道
  //     0.0, -1.0,  0.0, 0, 255, // 反转绿色通道
  //     0.0, 0.0,  -1.0, 0, 255, // 反转蓝色通道
  //     0.0, 0.0,  0.0, 1.0, 0,  // 保持Alpha不变
  //   ]),
  //   // 怀旧
  //   const ColorFilter.matrix([
  //     0.8, 0.3, 0.1, 0, 50,   // 增强红色和黄色
  //     0.1, 0.7, 0.2, 0, 30,   // 降低绿色通道
  //     0.1, 0.2, 0.5, 0, 20,   // 大幅降低蓝色
  //     0,    0,   0,   1, 0,
  //   ]),
  //   // 赛博p朋克
  //   const ColorFilter.matrix([
  //     1.5, 0.0, 0.0, 0, -50,  // 增强红色
  //     0.0, 1.2, 0.0, 0, -30,  // 增强绿色
  //     0.0, 0.0, 1.5, 0, -50,  // 增强蓝色
  //     0,    0,   0,   1, 0,
  //   ])

  // ];